api/application/models/index.html

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:ns1="http://sync.service.riemk.imc.com/"
                   xmlns:ns2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <SOAP-ENV:Header>
        <wsse:Security SOAP-ENV:mustUnderstand="1"
                       xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>3408dorofeeva</wsse:Username>
                <wsse:Password>579befoRe</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:disp_plan_create>
            <DISP_PLAN>
                <guid>5DF2A983-1E7A-4EDB-9BEC-541CD214D14B</guid>
                <enp>6351810897000893</enp>
                <disp_year>2017</disp_year>
                <disp_quarter>3</disp_quarter>
                <disp_type>1</disp_type>
                <disp_lpu>3408</disp_lpu>
                <age>36</age>
                <drcode>Ч574061</drcode>
                <speccode>1</speccode>
                <date_planning>2017-01-27</date_planning>
                <user_id>2710</user_id>
            </DISP_PLAN>
        </ns1:disp_plan_create>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope><?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <S:Fault xmlns:ns4="http://www.w3.org/2003/05/soap-envelope">
            <faultcode>S:Server</faultcode>
            <faultstring>Ошибка обработки запроса</faultstring>
            <detail>
                <ns2:RequestException xmlns:ns2="http://sync.service.riemk.imc.com/">
                    <errors>
                        <code>13</code>
                        <guid>5df2a983-1e7a-4edb-9bec-541cd214d14b</guid>
                    </errors>
                    <message>Ошибка обработки запроса</message>
                </ns2:RequestException>
            </detail>
        </S:Fault>
    </S:Body>
</S:Envelope>